# Nested Query

- `SELECT` block in `WHERE` or `HAVING` clauses
- Inner query returns single or multiple values
- Use result from the inner query to select specific rows in another query
- When returning single value, normal comparison operators can be used
    - `SELECT * FROM table_name HAVING MIN(col) < (SELECT MIN(other_col) FROM table_name);`
- When returning multiple values (as an output list), `IN` can be used for comparison
    - `SELECT * FROM table_name WHERE col IN (SELECT id FROM table_name);`
    - `SELECT * FROM table_name WHERE col IN (1,2,3,4);`
- See examples in slide

# Correlated nested queries

- References some column of a table in the outer query.
- 2 Tables are compared in the `WHERE` clause of the subquery / inner query
- Means: For each row in the outer query, loop through the inner query
- example:
```
SELECT *
FROM table1 as outer
WHERE 5 >
(SELECT COUNT(*)
FROM table2 as inner
WHERE inner.matching_col = outer.matching_col);
```
- Ways to construct such query:
    1. Write inner query first: 
    ```
    SELECT COUNT(*)
    FROM table2 as inner
    WHERE inner.matching_col = some_val;
    ```
    2. Join with inner query by replacing `some_val` with other/outer table's `matching_col` :
    ```
    (SELECT COUNT(*)
    FROM table2 as inner
    WHERE inner.matching_col = outer.matching_col);
    ```
    3. Provide outer query information:
    ```
    SELECT *
    FROM table1 as outer
    ```
    4. Join step 2 and step 3 with necessary `WHERE` keyword along with `OPERATORS` / `IN` / `EXISTS` etc condition:
    ```
    SELECT *
    FROM table1 as outer
    WHERE 5 >
    (SELECT COUNT(*)
    FROM table2 as inner
    WHERE inner.matching_col = outer.matching_col);
    ```

# EXISTS

- Special case of a correlated nested query.
- Tells us whether the result of a correlated nested query is empty or not.
- It returns: TRUE or FALSE, thus returns everything that meets the criteria
- TRUE = not empty -> row of the outer query is selected.
- FALSE = empty
- Always use `SELECT *` with `WHERE EXISTS`
- example:
    ```
    SELECT *
    FROM table1 as outer
    WHERE EXISTS
    (SELECT COUNT(*)
    FROM table2 as inner
    WHERE inner.matching_col = outer.matching_col);
    ```
- `NOT EXISTS` returns opposite of `EXISTS` from inner query

# UNION

- Set operation
- Takes common + uncommon elements in both tables (no duplicates allowed)
- example:
    ```
    SELECT * FROM table_1
        UNION
    SELECT * FROM table_2;
    ```
<center><img src="images/03.121.jpg"  style="width: 400px, height: 300px;"/></center>

# INTERSECT

- Set operation
- Takes common elements in both tables
- example:
    ```
    SELECT * FROM table_1
        INTERSECT
    SELECT * FROM table_2;
    ```
<center><img src="images/03.122.jpg"  style="width: 400px, height: 300px;"/></center>